#include "dom_11.h"

void Legk_avto::Print()
{
    cout << " Ћегковой автомобиль - дорожное механическое транспортное средство, иное, " <<
        "чем мотоцикл, предназначенное дл€ перевозки пассажиров и имеющее не более " <<
        "дев€ти сид€чих мест (включа€ место водител€). " << endl;
};

void Avtobus::Print()
{
    cout << " јвтобус - пассажирское дорожное механическое транспортное средство, " <<
        "предназначенное дл€ перевозки пассажиров и имеющее более дев€ти сид€чих мест (включа€ место водител€). " << endl;
};

void Bike::Print()
{
    cout << " ¬елосипед Ц транспортное средство, кроме инвалидных кол€сок, " <<
        "которое имеет по крайней мере два колеса и приводитс€ в движение " <<
        "как правило мускульной энергией лиц, наход€щихс€ на этом транспортном " <<
        "средстве, в частности при помощи педалей или руко€ток, и может также иметь " <<
        "электродвигатель номинальной максимальной мощностью в режиме длительной нагрузки, " <<
        "не превышающей 0,25 к¬т, автоматически отключающийс€ на скорости более 25 км/ч. " << endl;
};